Revit 2024 API
PipingSystem.BaseEquipmentConnector Property
The connector within base equipment which is used to connect with system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Connector BaseEquipmentConnector { get; set; }
Visual Basic
Public Property BaseEquipmentConnector As Connector
	Get
	Set
Visual C++
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
	void set (Connector^ value);
}
Remarks
Setting this property to null will disconnect base equipment from system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when assigning a connector which is used in a system, or when the connector's owner is not of type 'mechanical equipment'.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the set operation failed.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace